# DS3002 Final Project


#### Joseph Lee(sl5nj)

## Initial Setup

#### Import libraries and merging

In [ ]:
#https://www.kaggle.com/datasets/andrewmvd/sp-500-stocks?select=sp500_stocks.csv

In [293]:
#pip install kaggle

Requirement already satisfied: kaggle in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (1.5.12)
Requirement already satisfied: python-slugify in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from kaggle) (6.1.2)
Requirement already satisfied: requests in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from kaggle) (2.26.0)
Requirement already satisfied: six>=1.10 in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from kaggle) (1.16.0)
Requirement already satisfied: certifi in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from kaggle) (2021.10.8)
Requirement already satisfied: urllib3 in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from kaggle) (1.26.6)
Requirement already satisfied: tqdm in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from kaggle) (4.62.1)
Requirement already satisfied: python-dateutil in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from kaggle) (2.8.2)
Requirement already satisfied: text-unidecode>=1.3 in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from python-slugify->kaggle) (1.3)
Requirement already satisfied: idna<4,>=2.5 in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from requests->kaggle) (3.2)
Requirement already satisfied: charset-normalizer~=2.0.0 in /Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages (from requests->kaggle) (2.0.4)
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
import csv, json
import kaggle

In [2]:
!chmod 600 ~/.kaggle/kaggle.json

In [3]:
"""
Purpose: Stream data using api call
Data is updated daily*
"""
!kaggle datasets download -d andrewmvd/sp-500-stocks

Downloading sp-500-stocks.zip to /Users/sangwoolee/Dev/DS3002/Final/jupyternotebook
 99%|█████████████████████████████████████▊| 37.0M/37.2M [00:04<00:00, 8.31MB/s]
100%|██████████████████████████████████████| 37.2M/37.2M [00:04<00:00, 8.57MB/s]

In [4]:
from zipfile import ZipFile
file_name = 'sp-500-stocks.zip' #the file is your dataset exact name
with ZipFile(file_name, 'r') as zip:
  zip.extractall()
  print('Done')

Done

In [5]:
sp500_stocks = pd.read_csv("sp500_stocks.csv") # Reading Streamed Data
sp500_comp = pd.read_csv("sp500_companies.csv") # Reading Streamed Data

In [6]:
sp500_stocks2 = sp500_stocks

In [7]:
df = sp500_stocks2.merge(sp500_comp, how = 'left', left_on = 'Symbol', right_on = 'Symbol')

In [8]:
#df.to_csv('sp500_stockPrice.csv')
df
for col in df.columns:
    print(col)

Date
Symbol
Adj Close
Close
High
Low
Open
Volume
Exchange
Shortname
Longname
Sector
Industry
Currentprice
Marketcap
Ebitda
Revenuegrowth
City
State
Country
Fulltimeemployees
Longbusinesssummary
Weight

In [9]:
fdf = df[["Date", "Symbol","Adj Close", "Close", "High", "Low", "Open", "Volume", 
          "Exchange", "Shortname", "Sector", "Industry", "Marketcap", "City",
          "State", "Country"]]

In [10]:
#fdf2.head(2)

In [11]:
fdf.dtypes

Date          object
Symbol        object
Adj Close    float64
Close        float64
High         float64
Low          float64
Open         float64
Volume       float64
Exchange      object
Shortname     object
Sector        object
Industry      object
Marketcap    float64
City          object
State         object
Country       object
dtype: object

In [12]:
fdf['Date'] = pd.to_datetime(fdf['Date'])

/var/folders/d5/gxwrskh555z93r8slq5n8jh80000gn/T/ipykernel_67116/930706054.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fdf['Date'] = pd.to_datetime(fdf['Date'])

In [13]:
fdf.dtypes

Date         datetime64[ns]
Symbol               object
Adj Close           float64
Close               float64
High                float64
Low                 float64
Open                float64
Volume              float64
Exchange             object
Shortname            object
Sector               object
Industry             object
Marketcap           float64
City                 object
State                object
Country              object
dtype: object

In [14]:
fdf.head(2)

,Date,Symbol,Adj Close,Close,High,Low,Open,Volume,Exchange,Shortname,Sector,Industry,Marketcap,City,State,Country
0,2009-12-31,MMM,NaN,NaN,NaN,NaN,NaN,NaN,NYQ,3M Company,Industrials,Conglomerates,8.331593e+10,Saint Paul,MN,United States
1,2010-01-04,MMM,59.318886,83.019997,83.449997,82.669998,83.089996,3043700.0,NYQ,3M Company,Industrials,Conglomerates,8.331593e+10,Saint Paul,MN,United States

In [15]:
fdf2017 = fdf[(fdf['Date'] >= '2017-01-01') 
              & (fdf['Date'] <= '2017-12-31')]

fdf2018 = fdf[(fdf['Date'] >= '2018-01-01') 
              & (fdf['Date'] <= '2018-12-31')]

fdf2019 = fdf[(fdf['Date'] >= '2019-01-01') 
              & (fdf['Date'] <= '2019-12-31')]

fdf2020 = fdf[(fdf['Date'] >= '2020-01-01') 
              & (fdf['Date'] <= '2020-12-31')]

fdf2021 = fdf[(fdf['Date'] >= '2021-01-01') 
              & (fdf['Date'] <= '2021-12-31')]

In [16]:
fdf2017.to_csv('stockprice2017.csv', index = False)
fdf2018.to_csv('stockprice2018.csv', index = False)
fdf2019.to_csv('stockprice2019.csv', index = False)
fdf2020.to_csv('stockprice2020.csv', index = False)
fdf2021.to_csv('stockprice2021.csv', index = False)

## Reading streamed 2019 data

In [17]:
"""
The original dataset had daily stock price change data ranging from 2009 to 2022.
I streamed total 5 batched data that has year long information.

The years I streamed were from 2017 to 2021. I chose year 2019 daily stock change data to do analysis.
"""

df2019 = pd.read_csv("stockprice2019.csv")
df2019['Index'] = df2019.index+1

In [18]:
df2019.head(2)

,Date,Symbol,Adj Close,Close,High,Low,Open,Volume,Exchange,Shortname,Sector,Industry,Marketcap,City,State,Country,Index
0,2019-01-02,MMM,170.962708,190.949997,190.990005,186.699997,187.820007,2475200.0,NYQ,3M Company,Industrials,Conglomerates,8.331593e+10,Saint Paul,MN,United States,1
1,2019-01-03,MMM,164.525330,183.759995,188.279999,182.889999,188.279999,3358200.0,NYQ,3M Company,Industrials,Conglomerates,8.331593e+10,Saint Paul,MN,United States,2

## Connecting to MySQL

In [19]:
#pip install mysql-connector-python

#### Import libraries

In [20]:
import os
import pymysql
import mysql.connector as mysql
from mysql.connector import Error
from sqlalchemy import create_engine
from sqlalchemy.types import Integer, Text, String, DateTime, Float
import matplotlib.pyplot as plt
import pymongo
from pymongo import MongoClient

#### Setting up the Connection

In [21]:
"""
Connecting to MySQL section is to inputing credentials as well as to populate staging database.

Staging database will be used to subset tables into final database to create fact table using MySQL and MongoDB.
"""

host_name = "localhost"
host_ip = "127.0.0.0.1"
port = "3306"
user_id = "sl5nj"
password = "goHoos02!!"
db_name = "sp500"

In [22]:
conn = mysql.connect(host=host_name, user=user_id, 
                     password=password
                     )
cur = conn.cursor()
print("Connected to MySQL")

Connected to MySQL

#### Create Staging Database

In [23]:
"""
Purpose: querying into SQL to create staging database
         Upon successful connection, connection is closed
"""

dbquery = "create database if not exists sp500"
try:
    try:
        cur.execute(dbquery)
        print("Query Successful")
        print("Database has been created")
    except (mysql.Error, mysql.Warning) as e:
        print(e)

finally:
    if conn:
        conn.close()
        print("Connection is closed")

Query Successful
Database has been created
Connection is closed

#### Create Staging Table

In [24]:
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="sl5nj",
                               pw="goHoos02!!",
                               db="sp500"))

In [25]:
df2019.to_sql('price2019',
              con = engine, if_exists = 'replace',
              chunksize = 1000, index = False)

## Database Normalization

In [37]:
"""
This section is to normalize the staging table into 3 tables with primary key
"""

company = pd.read_csv("company.csv")

In [38]:
company.head(2)

,Symbol,Exchange,Shortname,Sector,Industry,Marketcap,City,State,Country
0,MMM,NYQ,3M Company,Industrials,Conglomerates,8.490338e+10,Saint Paul,MN,United States
1,MMM,NYQ,3M Company,Industrials,Conglomerates,8.490338e+10,Saint Paul,MN,United States

In [39]:
#Removing duplicate company names
company_unique = company.drop_duplicates(subset = ["Symbol"])

In [40]:
#Resetting index
company_unique.reset_index(inplace=True)

In [41]:
#Adding new index +1 naming ticker_id
company_unique["ticker_id"] = company_unique.index+1

/var/folders/d5/gxwrskh555z93r8slq5n8jh80000gn/T/ipykernel_67116/1980286111.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  company_unique["ticker_id"] = company_unique.index+1

In [42]:
#Removing original index column
del company_unique['index']

In [43]:
#Reordering columns
company_unique = company_unique.reindex(columns=
                                        ['ticker_id',
                                         'Symbol',
                                         'Exchange',
                                         'Shortname',
                                         'Sector',
                                         'Industry',
                                         'Marketcap',
                                         'City',
                                         'State',
                                         'Country'])

In [44]:
company_unique.head(2)

,ticker_id,Symbol,Exchange,Shortname,Sector,Industry,Marketcap,City,State,Country
0,1,MMM,NYQ,3M Company,Industrials,Conglomerates,8.490338e+10,Saint Paul,MN,United States
1,2,AOS,NYQ,A.O. Smith Corporation,Industrials,Specialty Industrial Machinery,1.016567e+10,Milwaukee,WI,United States

In [45]:
companydf = company_unique[["ticker_id", 
                            "Shortname", "City",
                            "State",
                            "Country"]]

In [46]:
#Change name of id to company_id
companydf.rename({'ticker_id' : 'company_id',
                 'Shortname' : 'company_name'}, axis = 1, inplace = True)

/Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:5034: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [47]:
companydf = companydf.rename(columns=str.lower)

In [48]:
companydf.head(2)

   company_id            company_name        city state        country
0           1              3M Company  Saint Paul    MN  United States
1           2  A.O. Smith Corporation   Milwaukee    WI  United States

In [49]:
tickerdf = company_unique[["ticker_id",
                           "Symbol",
                           "Exchange",
                           "Sector",
                           "Industry",
                           "Marketcap"]]

In [50]:
tickerdf = tickerdf.rename(columns=str.lower)

In [51]:
tickerdf.head(2)

,ticker_id,symbol,exchange,sector,industry,marketcap
0,1,MMM,NYQ,Industrials,Conglomerates,8.490338e+10
1,2,AOS,NYQ,Industrials,Specialty Industrial Machinery,1.016567e+10

In [52]:
df2019.head(2)

,Date,Symbol,Adj Close,Close,High,Low,Open,Volume,Exchange,Shortname,Sector,Industry,Marketcap,City,State,Country,Index
0,2019-01-02,MMM,170.962708,190.949997,190.990005,186.699997,187.820007,2475200.0,NYQ,3M Company,Industrials,Conglomerates,8.331593e+10,Saint Paul,MN,United States,1
1,2019-01-03,MMM,164.525330,183.759995,188.279999,182.889999,188.279999,3358200.0,NYQ,3M Company,Industrials,Conglomerates,8.331593e+10,Saint Paul,MN,United States,2

In [53]:
"""
Purpose: Subsetting columns for price table
"""

pricesdf = df2019[['Index', 'Date', 'Symbol',
                 'Adj Close', 'Close',
                 'High', 'Low', 'Open',
                 'Volume']]

In [54]:
#Change name of id to company_id
pricesdf.rename({'Index' : 'price_id',
                 'Symbol' : 'ticker',
                'Adj Close' : 'adj_close'}, axis = 1, inplace = True)

/Users/sangwoolee/opt/anaconda3/lib/python3.8/site-packages/pandas/core/frame.py:5034: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [55]:
#setting column names to lowercase
pricesdf = pricesdf.rename(columns=str.lower)

In [56]:
pricesdf.head(2)

,price_id,date,ticker,adj_close,close,high,low,open,volume
0,1,2019-01-02,MMM,170.962708,190.949997,190.990005,186.699997,187.820007,2475200.0
1,2,2019-01-03,MMM,164.525330,183.759995,188.279999,182.889999,188.279999,3358200.0

## Sending Normalized Tables to Staging Database

In [57]:
"""
Purpose of this section is to send normalized tables into staging database, which will be used to populate 
normalized final database
"""

'\nPurpose of this section is to send normalized tables into staging database, which will be used to populate \nnormalized final database\n'

#### Stock Price Dataset

In [58]:
pricesdf['date'] = pd.to_datetime(pricesdf['date'], infer_datetime_format=True)

In [59]:
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="sl5nj",
                               pw="goHoos02!!",
                               db="sp500"))

In [60]:
"""
Purpose: Sending price table into staging database
"""
pricesdf.to_sql('price',
              con = engine, if_exists = 'replace',
                dtype={'price_id' : Integer,
                       'date' : DateTime,
                       'ticker' : String(5),
                       'adj_close' : Float(precision=9, asdecimal=True),
                       'close' : Float(precision=9, asdecimal=True),
                       'high' : Float(precision=9, asdecimal=True),
                       'low' : Float(precision=9, asdecimal=True),
                       'open' : Float(precision=9, asdecimal=True),
                       'volume' : Float(precision=9, asdecimal=True)},
              chunksize = 1000, index = False)

#### Ticker Dataset

In [61]:
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="sl5nj",
                               pw="goHoos02!!",
                               db="sp500"))

In [62]:
"""
Purpose: Sending ticker table into staging database
"""
tickerdf.to_sql('ticker',
              con = engine, if_exists = 'replace',
                dtype = {'ticker_id' : Integer,
                         'symbol' : String(10),
                         'exchange' : String(10),
                         'sector' : String(100),
                         'industry' : Text,
                         'marketcap' : Float(precision=3, asdecimal=True)},
              chunksize = 1000, index = False)

#### Company Dataset

In [63]:
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="sl5nj",
                               pw="goHoos02!!",
                               db="sp500"))

In [64]:
"""
Purpose: Sending company table into staging database
         This table will be used to download json file to be saved into mongoDB
"""
companydf.to_sql('company',
              con = engine, if_exists = 'replace',
                 dtype = {'company_id' : Integer,
                         'compnay_name' : Text,
                         'city' : String(100),
                         'country' : String(150)},
              chunksize = 1000, index = False)

## Create Final Database

In [65]:
conn = mysql.connect(host=host_name, user=user_id, 
                     password=password
                     )
cur = conn.cursor()
print("Connected to MySQL")

Connected to MySQL

In [66]:
"""
Purpose: create final database in MySQL
"""

dbquery = "create database if not exists sp500_stocks"
try:
    try:
        cur.execute(dbquery)
        print("Query Successful")
        print("Database has been created")
    except (mysql.Error, mysql.Warning) as e:
        print(e)

finally:
    if conn:
        conn.close()
        print("Connection is closed")

Query Successful
Database has been created
Connection is closed

## Connecting to MongoDB

#### Assign Connection Variables

In [67]:
ports = {"mongo" : 27017, "mysql" : 3306}
src_dbname = "sp500_companyinfo"
dst_dbname = "sp500_stocks"

#### Functions

In [68]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(user_id, pwd, host_name, port, db_name, collection, query):
    '''Create a connection to MongoDB, with or without authentication credentials'''
    if user_id and pwd:
        mongo_uri = 'mongodb://%s:%s@%s:%s/%s' % (username, password, host, port, db_name)
        client = pymongo.MongoClient(mongo_uri)
    else:
        conn_str = f"mongodb://{host_name}:{port}/"
        client = pymongo.MongoClient(conn_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Populate MongoDB with JSON file from Staging Database

Run only one time

In [69]:
"""
Purpose: Sending company table json file into mongoDB
"""

"""
port = ports["mongo"]
conn_str = f"mongodb://{host_name}:{port}/"
client = pymongo.MongoClient(conn_str)
db = client[src_dbname]

data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"companies" : 'company.json'}

for file in json_files:
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.") #already commented

        
client.close() 
"""

'\nport = ports["mongo"]\nconn_str = f"mongodb://{host_name}:{port}/"\nclient = pymongo.MongoClient(conn_str)\ndb = client[src_dbname]\n\ndata_dir = os.path.join(os.getcwd(), \'data\')\n\njson_files = {"companies" : \'company.json\'}\n\nfor file in json_files:\n    json_file = os.path.join(data_dir, json_files[file])\n    with open(json_file, \'r\') as openfile:\n        json_object = json.load(openfile)\n        file = db[file]\n        result = file.insert_many(json_object)\n        #print(f"{file} was successfully loaded.") #already commented\n\n        \nclient.close() \n'

#### Exract data from MongoDB to Dataframe

In [70]:
query = {}
port = ports["mongo"]
collection = "companies"

companies_mongo = get_mongo_dataframe(None, None, host_name, port, src_dbname, collection, query)
companies_mongo.head(2)

   company_id            company_name        city state        country
0           1              3M Company  Saint Paul    MN  United States
1           2  A.O. Smith Corporation   Milwaukee    WI  United States

#### Import it into SQL

In [71]:
"""
Purpose: Sending normalized company table from MongoDB to MySQL
         Setting primary key to 'company_id'
"""

dataframe = companies_mongo
table_name = 'companies'
primary_key = 'company_id'
db_operation = "insert"

set_dataframe(user_id, password, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

## Creating Fact Table

#### Assigning variables for MySQL communication

In [72]:
src_db = "sp500"
dst_db = "sp500_stocks"

#### Define Functions to Communicate with MySQL

In [73]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe

def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, connection);
    connection.close()
    
    return dframe

def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Query Dimension Tables

In [74]:
"""
Purpose: Query normalized tables from staging database (ticker and price) and company data from final database
"""

'\nPurpose: Query normalized tables from staging database (ticker and price) and company data from final database\n'

In [75]:
sql_queryticker = "select * from sp500.ticker;"
df_ticker = get_sql_dataframe(user_id, password, host_name, src_db, sql_queryticker)
df_ticker.head(2)

,ticker_id,symbol,exchange,sector,industry,marketcap
0,1,MMM,NYQ,Industrials,Conglomerates,8.490340e+10
1,2,AOS,NYQ,Industrials,Specialty Industrial Machinery,1.016570e+10

In [76]:
sql_queryprice = "select * from sp500.price;"
df_price = get_sql_dataframe(user_id, password, host_name, src_db, sql_queryprice)
df_price.head(2)

,price_id,date,ticker,adj_close,close,high,low,open,volume
0,1,2019-01-02,MMM,170.963,190.95,190.99,186.70,187.82,2475200.0
1,2,2019-01-03,MMM,164.525,183.76,188.28,182.89,188.28,3358200.0

In [77]:
sql_querycompany = "select * from sp500_stocks.companies;"
df_companies = get_sql_dataframe(user_id, password, host_name, src_db, sql_querycompany)
df_companies.head(2)

   company_id            company_name        city state        country
0           1              3M Company  Saint Paul    MN  United States
1           2  A.O. Smith Corporation   Milwaukee    WI  United States

#### Insert Tables into final Database

In [78]:
"""
Purpose: Insert retrieved tables from staging database to final database before populating fact table
         Primary key: price = 'price_id' & ticker = 'ticker_id'
"""
db_operation = "insert"
tables = [('stock_prices', df_price, 'price_id'),
          ('stock_tickers', df_ticker, 'ticker_id')]

In [79]:
for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, password, host_name, dst_db, dataframe, table_name, primary_key, db_operation)

#### Create Fact Table

In [80]:
sql_fact_orders = """
    SELECT c.company_id,
        st.ticker_id,
        sp.price_id,
        sp.date,
        sp.ticker,
        sp.adj_close,
        sp.close,
        sp.high,
        sp.low,
        sp.open,
        sp.volume,
        st.exchange,
        c.company_name,
        st.sector,
        st.industry,
        st.marketcap,
        c.city,
        c.state,
        c.country
    FROM sp500_stocks.companies as c
    left outer join sp500_stocks.stock_tickers as st
    on c.company_id = st.ticker_id
    left outer join sp500_stocks.stock_prices as sp
    on sp.ticker = st.symbol;
"""

In [81]:
df_fact_sp500 = get_dataframe(user_id, password, host_name, dst_db, sql_fact_orders)
df_fact_sp500.head(2)

,company_id,ticker_id,price_id,date,ticker,adj_close,close,high,low,open,volume,exchange,company_name,sector,industry,marketcap,city,state,country
0,1,1,252.0,2019-12-31,MMM,163.276,176.42,176.59,175.07,175.23,1573500.0,NYQ,3M Company,Industrials,Conglomerates,8.490340e+10,Saint Paul,MN,United States
1,1,1,251.0,2019-12-30,MMM,162.730,175.83,178.96,175.59,177.26,1715100.0,NYQ,3M Company,Industrials,Conglomerates,8.490340e+10,Saint Paul,MN,United States

#### Insert Fact Table into DB

In [82]:
df_fact_sp500.reset_index(inplace=True)
df_fact_sp500["fact_id"] = df_fact_sp500.index+1
#Removing original index column
del df_fact_sp500['index']
#Reordering columns
df_fact_sp500 = df_fact_sp500.reindex(columns=
                                        ['fact_id',
                                         'company_id',
                                         'ticker_id',
                                         'price_id',
                                         'date',
                                         'ticker',
                                         'adj_close',
                                         'close',
                                         'high',
                                         'low',
                                         'open',
                                         'volume',
                                         'exchange',
                                         'company_name',
                                         'sector',
                                         'industry',
                                         'marketcap',
                                         'city',
                                         'state',
                                         'country'])
df_fact_sp500.head(2)

,fact_id,company_id,ticker_id,price_id,date,ticker,adj_close,close,high,low,open,volume,exchange,company_name,sector,industry,marketcap,city,state,country
0,1,1,1,252.0,2019-12-31,MMM,163.276,176.42,176.59,175.07,175.23,1573500.0,NYQ,3M Company,Industrials,Conglomerates,8.490340e+10,Saint Paul,MN,United States
1,2,1,1,251.0,2019-12-30,MMM,162.730,175.83,178.96,175.59,177.26,1715100.0,NYQ,3M Company,Industrials,Conglomerates,8.490340e+10,Saint Paul,MN,United States

In [83]:
tb_name = "fact_stock"
fact_pk = "fact_id"
set_dataframe(user_id, password, host_name, dst_db, df_fact_sp500, tb_name, fact_pk, db_operation)

## Create Visualization

#### Subsetting Dataframe with Ticker Names
##### AAPL (Apple), FB (Facebook), GOOGL (Google), MSFT (Microsoft), NFLX (Netflix)

In [84]:
"""
Purpose: Preparing the dataframe to create visualization
         Interested companies: Apple, Facebook, Google, Microsoft, and Netflix

Outcome: csv file 
"""

'\nPurpose: Preparing the dataframe to create visualization\n         Interested companies: Apple, Facebook, Google, Microsoft, and Netflix\n\nOutcome: csv file \n'

In [85]:
condition = ['AAPL','FB', 'GOOGL', 'MSFT', 'NFLX']
sp500vis = df_fact_sp500[(df_fact_sp500['ticker'].str.contains("AAPL"))
                            | (df_fact_sp500['ticker'].str.contains("FB"))
                            | (df_fact_sp500['ticker'].str.contains("GOOGL"))
                            | (df_fact_sp500['ticker'].str.contains("MSFT"))
                            | (df_fact_sp500['ticker'].str.contains("NFLX"))]

In [86]:
#drop FBHS
sp500vis = sp500vis[sp500vis["ticker"].str.contains("FBHS") == False]

In [87]:
#sp500vis.to_csv('sp500vis.csv',index=False)

##### Visualization was created on RStudio

In [88]:
from PIL import Image

image = Image.open('visualization_proof_rstudio.png')
image.show()

In [89]:
image2 = Image.open('visualization_proof_rstudio2.png')
image2.show()